s = str(input('Enter some string:'))
print(s)
# a.
print('Третий символ строки:', s[2])
# b.
print('Предпоследний символ строки:', s[-2])
# c.
print('Первые 5 символов строки:', s[:5])
# d.
print('Вся строка, кроме последних двух символов:', s[:-2])
# e.
print('Символы с четными индексами:', s[::2])
# f.
print('Символы с нечетными индексами:', s[1::2])
# g.
print('Все символы в обратном порядке:', s[::-1])
# h.
print('Символы в обратном порядке через один:', s[::-2])
# i.
print('Длина строки:', len(s))
